import pandas as pd
import pytest


@pytest.fixture
def settings() -> dict:
    return {"user_currencies": ["USD"], "user_stocks": ["AAPL"]}


@pytest.fixture
def card_transactions() -> pd.DataFrame:
    return pd.DataFrame(
        [
            {
                "Дата операции": "03.04.2018 14:55:21",
                "Дата платежа": "05.04.2018",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -21.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -21.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": 439,
                "Категория": "Красота",
                "MCC": 5977.0,
                "Описание": "OOO Balid",
                "Бонусы (включая кэшбэк)": 0,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 21.0,
            },
            {
                "Дата операции": "01.02.2019 20:27:51",
                "Дата платежа": "04.02.2019",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -316.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -316.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": 599,
                "Категория": "Дом и ремонт",
                "MCC": 5977.0,
                "Описание": "OOO Balid",
                "Бонусы (включая кэшбэк)": 6,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 316.0,
            },
            {
                "Дата операции": "01.07.2020 12:49:53",
                "Дата платежа": "01.07.2020",
                "Номер карты": "*7333",
                "Статус": "OK",
                "Сумма операции": -3000.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -3000.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": 12,
                "Категория": "Переводы",
                "MCC": 1200.0,
                "Описание": "Линзомат ТЦ Юность",
                "Бонусы (включая кэшбэк)": 0,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 3000.0,
            },
        ]
    )
